# 문제 1. 데이터 가져오기 
- titanic_train.csv 파일과 titanic_test.csv 파일을 불러오세요
- train, test로 저장하기

In [18]:
import pandas as pd

train = pd.read_csv("data/titanic_train.csv")
test = pd.read_csv("data/titanic_test.csv")

train.shape, test.shape

((891, 12), (418, 11))

In [19]:
#import pandas as pd
#train = pd.read_csv("data/titanic_train.csv")

#train

#train.shape, test.shape

In [20]:
#test = pd.read_csv("data/titanic_test.csv")
#test

# 문제 2. loc 활용
- Passenger ID가 9인 승객 정보 가져오기
- loc문법만 활용

In [22]:
train.loc[8]

PassengerId                                                    9
Survived                                                       1
Pclass                                                         3
Name           Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
Sex                                                       female
Age                                                         27.0
SibSp                                                          0
Parch                                                          2
Ticket                                                    347742
Fare                                                     11.1333
Cabin                                                        NaN
Embarked                                                       S
Name: 8, dtype: object

In [13]:
#train.loc[train['PassengerId'] == 9, :]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S

# 문제 3. loc 활용
- Passenger ID가 1-10사이에서 짝수 ID만 가져오기 (슬라이싱만 활용)
- 특정 컬럼만 조회 : PassengerId, Survived, Sex, Fare, Embarked
- loc문법만 활용

In [26]:
train.loc[1:9:2, ['PassengerId','Survived', 'Sex', 'Fare', 'Embarked']]

   PassengerId  Survived     Sex     Fare Embarked
1            2         1  female  71.2833        C
3            4         1  female  53.1000        S
5            6         0    male   8.4583        Q
7            8         0    male  21.0750        S
9           10         1  female  30.0708        C

In [23]:
#train.loc[train['PassengerId']:, 1:11:2]
#train.loc[train['PassengerId']('Survived', 'Sex', 'Fare', 'Embarked')], 1:11:2]

# 문제 4. GroupBy 연산
- 아래와 같이 pivot Table 구현한 것을 Group By 연산으로 적용할 것

In [4]:
train.pivot_table(index='Sex', columns='Pclass', values='Fare', aggfunc='mean')

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [30]:
#피벗과 그룹 바이 중 하나만 파면 됨. 피벗과 똑같이 만들 수 있음
train.groupby(['Sex','Pclass'])['Fare'].mean().unstack()

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

# 문제 5 Join문제
- members.csv와 orders.csv 파일 확인
    + members.csv : 회원정보 
    + orders.csv : 주문정보 
- 성별, 연령별 '주문' 평균금액 구하기
- 주의) CSV 파일 열어보지 말기

In [45]:
members = pd.read_csv("data/members.csv")
orders = pd.read_csv("data/orders.csv")

#orders.head(1)
#head로 불러와서 데이터 확인하면 되니, 엑셀 파일 먼저 확인 안 해도 됨

# 조인 하려면 key 값 확인해야 함
# 컬럼명 확인 필요

print('Members Columns:', members.columns)
print('Orders Columns:', orders.columns)

#모든 회원이 다 주문을 하지는 않음. 이런 로직을 감안해서 해야 함. 
#embers에서 100명이어도, orders에선 90명일 수 있음

df = pd.merge(members, orders, on='회원ID', how='left')
result = df.groupby(['성별', '나이'])['주문금액'].mean()
result.unstack()

Members Columns: Index(['회원ID', '회원명', '나이', '성별'], dtype='object')
Orders Columns: Index(['주문ID', '회원ID', '주문금액', '주문일자'], dtype='object')

나이,25,27,28,29,31,32,33,35,42,45
성별,,,,,,,,,,
F,NaN,40774.5,NaN,71044.666667,NaN,39754.0,NaN,45776.5,NaN,NaN
M,50155.0,NaN,94127.5,NaN,84481.0,NaN,NaN,NaN,52919.0,65578.5